"""
Текстова гра на тему Українських народних казок
Правила гри:
    Гравець має обирати персонажа, за яким він буде грати. Потім гравець починає свою
    пригоду у вигляді текстових повідомлень. Гра складається з декількох етапів, на кожному з яких гравець зустрічає нових
    персонажів та переживає різні пригоди. Гравець має право вибирати, як він хоче діяти у певній
    ситуації: діалог з персонажем, бій, втеча тощо. Залежно від вибору гравця, відбуваються різні
    наслідки.

Приклади:

* Гравець обирає персонажем козака. Він зустрічає чаклуна, який накладає на нього прокляття.
    Гравець може спробувати розв'язати прокляття, знайти антидот або битися з чаклуном.
    Залежно від вибору гравця, він може отримати нову здатність або втратити частину своїх вмінь.
* Гравець обирає персонажем пересмішника. Він потрапляє в хитру ситуацію, де йому потрібно
    обдурити злодія. Гравець може скористатися своїм словесним даром, знайти слабкі місця
    злодія або спробувати зібрати команду з іншими персонажами для змагання проти злодія.

Ідеї для  тестів:

    Тест на перевірку правильності вибору персонажа гравцем.
    Тест на перевірку вибору гравцем діалогу, який приводить до нової здатності персонажа.
    Тест на перевірку вибору гравцем діалогу, який приводить до втрати здатностей персонажа.
    Тест на перевірку правильності вибору гравцем
    Тест на введення некоректної відповіді гравцем: спроба ввести символи, відмінні від "так" і "ні".
    Тест на перехід до наступної дії: перевірка, чи збільшується лічильник після завершення попередньої.
    Тест на завершення гри: перевірка, що гравець не може перейти до наступної дії, якщо він вже завершив останню.
    Тест на вибір гравцем дії: перевірка, чи збільшується лічильник правильних відповідей після кожної правильної відповіді.

Поради до написання коду:

1. Створіть словник, що містить перелік персонажів та їх характеристик, таких як ім'я,
    рівень життя, сила тощо.
2. Запросіть у гравця вибір персонажа зі списку.
3. Визначте етапи гри, наприклад, "Зустріч з першим персонажем", "Бій з монстром",
    "Вирішення головоломки" тощо.
4. Для кожного етапу гри створіть функцію, яка відповідає за обробку цього етапу.
    Функція повинна виводити текстове повідомлення, яке описує ситуацію гравця,
    а також список доступних дій, які гравець може вибрати. Наприклад,
    "Ви зустрілися з гобліном. Що ви будете робити?
    1. Почати діалог з ним. 2. Розпочати бій. 3. Спробувати втекти".
5. Для кожної дії, яку може вибрати гравець, створіть окрему функцію.
    Функція повинна перевіряти, чи є ця дія можливою в поточній ситуації,
    і виконувати відповідні дії. Наприклад, якщо гравець вибирає
    "Розпочати бій", функція повинна розпочати бій з монстром і вивести повідомлення про результат.
6. Для обробки помилок та виключень, наприклад, якщо гравець ввів
    неправильне значення, використовуйте блоки try/except.
7. Для збереження прогресу гравця у грі, зберігайте дані у файл.

Не ускладнюйте собі життя:
Достатньо 3 персонажи та 3 дії а також 3  кроки:
    1. початок(вибір героя - Котигорошко, Змій, кінь)
    2. взаємодія(комп'ютер обирає героя з тих що лишилися і пропонує дії гравцю)
    3. розв'язка ( відповідно до обраних дій та коефіцієнтів - перемога, поразка чи нічия)
І треба хоча б 9 тестів на усе це добро.
"""


import random
from olena_logger import logger

heroes = {
    'Котигорошко': {
        'назва': 'Котигорошко',
        'сила': 100,
        'рівень життя': 100
    },
    'Івасик-Телесик': {
        'назва': 'Івасик-Телесик',
        'сила': 100,
        'рівень життя': 100
    },
    'Пан Коцький': {
        'назва': 'Пан Коцький',
        'сила': 100,
        'рівень життя': 100
    }
}
def hello():
    print("Привіт. Це початок гри. Скористайся текстовими інструкціями")

hero = {}
enemy = {}


def choose_hero():
    """Вибір персонажу"""

    while True:
       print("**********************")
       you_hero = input("Виберіть героя зі списку: Котигорошко, Івасик-Телесик, Пан Коцький: ")
       try: 
           if you_hero in heroes:
               print("**********************")
               hero.update(heroes[you_hero])
               print (f'Привіт, {hero["назва"]}, твої початкові дані - сила: {hero["сила"]}, рівень життя: {hero["рівень життя"]}')
               break
           else:
               print(f'Героя немає в списку, повторіть спробу')   
               continue
       except ValueError as e:
           logger.error('Precondition is failed')
           print(e)
    logger.info(f"Hero choosen, {you_hero}")
    return hero  
      
def choose_enemy():
    hero = choose_hero()['назва']
    players = list(heroes)
    players.remove(str(hero)) 
    your_enemy = random.choice(players)
    enemy.update(heroes[your_enemy])
    print(f"Твій супротивник на цю гру {your_enemy}, його рівень - сила: {enemy['сила']}, рівень життя: {enemy['рівень життя']}")
    logger.info(f"Enemy choosen, {your_enemy}")
    return enemy

def choose_game():
    if hero["сила"] <= 0 or hero["рівень життя"] <=0:
        print(f'Гру закінчено. Твої показники - сила: {hero["сила"]}, рівень життя: {hero["рівень життя"]}')
        logger.info(f'Game over')
    else:       
        action = input("Що ти обереш?\n1. Пограти в гру.\n2. Розпочати бій.\n3. Вихід з гри.\nВиберіть один із трьох варіантів (1, 2, 3): ")
        if action == "1":
            print("Починаємо гру. Гравець має 5 спроб відгадати випадкове число від 1 до 20")
            guess_number()
            logger.info('guess_number game choosen')
        elif action == "2":
            fight()
            logger.info('fight game choosen')
        elif action == "3":
            print(f'Ти покидаєш гру, до зустрічі. Твої показники - сила: {hero["сила"]}, рівень життя: {hero["рівень життя"]}')
            logger.info('Game over')


def guess_number():
    print("**********************")
    secret_number = random.randint(1, 20)
    guesses = 0
    max_guesses = 5
    for x in range(guesses, max_guesses):
        number =  int(input("Guess the number from 1 to 20 in 5 tries!: "))
        if number < secret_number:
            print("Число менше ніж загадане")
            hero["рівень життя"]-=10
        elif number > secret_number:
            print("Число більше ніж загадане")
            hero["сила"]-=10
        else:
            print("ти виграв!")
            hero["рівень життя"]+=10
            hero["сила"]+=10
            break 
    choose_game()

def fight():
    print("**********************")
    while enemy["рівень життя"] > 0:
        print(f'Твої показники - сила: {hero["сила"]}, рівень життя: {hero["рівень життя"]}')
        print(f'Показники {enemy["назва"]} - сила: {enemy["сила"]}, рівень життя: {enemy["рівень життя"]}')
        print("**********************")
        x = int(input("1. Битися.\n2. Спробувати ухилитись.\n3. Втекти.\nВиберіть один із трьох варіантів (1, 2, 3): "))
        print("**********************")
        if x == 1:
            enemy["рівень життя"] -= random.randint(0,50)
            print("**********************")
            print(f"Ти вдарив противника, у нього лишилося життя: {enemy['рівень життя']}")
            hero["сила"] -= random.randint(0,5)
            print(f"На це було витрачено сили, залишок сил: {hero['сила']}")
            if hero['рівень життя'] < 0 or hero["сила"] < 0:
                print("Ти програв")             
            elif enemy['рівень життя'] < 0 or enemy["сила"] < 0:
                print("Ти виграв")
        elif x == 2:
            hero["рівень життя"] -= random.randint(0,5)
            print("**********************")
            print(f"Противник поцілив у тебе, у тебе лишилося життя: {hero['рівень життя']}") 
            if hero['рівень життя'] < 0 or hero["сила"] < 0:
                print("Ти програв")             
            elif enemy['рівень життя'] < 0 or enemy["сила"] < 0:
                print("Ти виграв")
        elif x == 3:
             print(f'Ти покидаєш гру, до зустрічі. Твої показники - сила: {hero["сила"]}, рівень життя: {hero["рівень життя"]}')
             logger.info('Game over')
             break


hello()
choose_enemy()
choose_game()