# task 1
"""  Уявіть, що інопланетянина з кольором alien_color щойно збили в грі.
Створіть змінну під назвою alien_color і призначте їй значення 'green', 'yellow', або 'red'.
Напишіть оператор if, щоб перевірити, чи колір прибульця 'green'.
Якщо так, надрукуйте повідомлення про те, що гравець щойно заробив 5 балів.
"""


alien_color = 'green'
if alien_color == 'green':
    print("# task 1", "Ти щойно заробив 5 балів")

# task 2
"""  Скопіюйте пеопередню відповідь, змініть і доповніть її умовою else.
Якщо колір прибульця зелений, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця не зелений, надрукуйте, що гравець щойно заробив 10 балів.
Зробіть так, щоб виводилася умова else.
"""

alien_color = 'red'
if alien_color == 'green':
    print("Ти щойно заробив 5 балів")
else:
    print("# task 2", "Ти щойно заробив 10 балів")

# task 3
# task 4
"""  Скопіюйте пеопередню відповідь, змініть і доповніть її умовою elif.
змінну під назвою alien_color перетворіть у список значень: 'green', 'yellow', 'red'
Якщо колір прибульця зелений, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця не зелений, надрукуйте, що гравець щойно заробив 10 балів.
Якщо прибулець червоний, надрукуйте повідомлення про те, що гравець заробив 15 очок
+ напишіть цикл for що перебере і обробить всі значення списку alien_color
"""
alien_color = ['green', 'yellow', 'red']
alien_color_real = str(input('Колір прибульця: '))

for i in alien_color:
    if alien_color_real == 'green':
        print("Ти щойно заробив 5 балів")
        break
    elif alien_color_real == 'yellow':
        print("Ти щойно заробив 10 балів")
        break
    elif alien_color_real == 'red':
        print("Ти щойно заробив 15 балів")
        break
    else:
        print("404 not found")
        break

# task 5
"""  Начинки для піци (pizza_topping): напишіть цикл, який пропонує користувачеві ввести ряд начинок
для піци, доки він не введе значення 'quit'. Коли вони введуть кожну начинку,
надрукуйте повідомлення про те, що ви додасте цю начинку до їхньої піци.
"""

while True:
    pizza_topping = str(input('Введите начинки, или напишите "quit" для выхода'))
    if pizza_topping == 'quit':
        break
    print("# task 5", "Вы добавите", pizza_topping, "в свою пиццу")

# task 6
"""  Напишіть програму, яка знаходить суму всіх цифр натурального числа, яке вводить користувач.
Використовуйте цикл while. Виведіть суму цифр числа на екран.
Приклад виконання програми:
Введіть натуральне число: 12345
Сума цифр числа 12345: 15
"""
number = input("Введите число: ")
sum2 = 0
i = 0
while i < len(number):
    digit = int(number[i])
    sum2 += digit
    i += 1
print("# task 6", "Сумма цифр числа", number, ":", sum2)

""
# task 7
"""  Потрібно написати програму, яка просить користувача ввести числа, доки він не введе 0.
Програма повинна підрахувати суму всіх введених чисел, окрім 0, і вивести її на екран.
Розв'язати з використанням циклу while та break
"""

sum1 = 0
while True:
    number_space = input("Введи число > 0: ")
    if number_space == '0':
        break
    elif int(number_space) > 0:
        sum1 += int(number_space)
        print("# task 7", sum1)

# task 8
"""  З використанням циклу for реалізуйте гру "Вгадай число".
Початок програми написаний, гравець має 5 спроб відгадати випадкове число від 1 до 20,
яке було згенеровано за допомогою функції randint() модуля random.
У кожній спробі гравець вводить своє припущення, після чого програма повідомляє, чи
було припущення занадто великим або занадто малим, чи гравець вгадав число.
"""

import random
secret_number = random.randint(1, 10)
guesses = 0
max_guesses = 5
print("Вгадайте число від 1 до 20 за 5 спроб!")
while True:
    game_number = input()
    for i in game_number:
        if int(game_number) == secret_number:
            if True or False:
                guesses += 1
                if guesses == 6:
                    break
                    print("Ты проиграл, попробуй снова. Использовано попыток", guesses, "из  5")
            print("Ты угадал, твой приз 200 грн!")
        elif int(game_number) < secret_number:
            if True or False:
                guesses += 1
                if guesses == 6:
                    break
                    print("Ты проиграл, попробуй снова")
            print("Выиграшное число больше твоего. Использовано попыток", guesses, " из  5")
        elif int(game_number) > secret_number:
            if True or False:
                guesses += 1
                if guesses == 6:
                    break
                    print("Ты проиграл, попробуй снова")
            print("Выиграшное число меньше твоего. Использовано попыток", guesses, " из  5")


# task 9
"""  Задача з використанням циклу for та continue. Задано список фруктів 'fruits'
потрібно вивести на екран всі елементи списку, окрім "orange".
"""

fruits = ["apple", "banana", "orange", "grape", "mango"]
for fruit in fruits:
    if fruit == "orange":
        continue
    print("task 9", fruit)

